downloadS1 = "⏳ <b>الرجاء الانتظار...</b> <i>يتم تجهيز الملف</i> 📀"

downloadS2 = "🚀 <b>الرجاء الانتظار...</b> <i>الملف في الطريق إليك!</i> 📦"

downloadS3 = "🎉 <b>تم رفع الملف!</b> <i>جارٍ الاتصال...</i> 🚀"




TitleMsg_msg = "العنوان 🎶 "
DurationMsg_msg = "المدة "



Alert_Admin_msg = "❗ <b>عذرًا</b>، لست مشرفًا لتنفيذ <i>{action}</i> على {usermention} 😂"

No_One_In_Call_msg = "📭 <b>عذرًا</b>، لا يوجد أحد في المكالمة 😒"

Alert_Wait_For_Prev_msg = "🔄 <b>يرجى الانتظار</b> حتى يتم تحميل الأغنية السابقة {usermention}"

Chose_Vid_msg = "📺 <b>الرجاء اختيار الفيديو المطلوب:</b>"

No_Cureent_Song_msg = "❌ <b>عذرًا</b>، لا توجد أغنية حالية لتنفيذ <i>{action}</i> من {usermention} 〰"

UserBot_Not_In_Call_msg = "🤖 <b>عذرًا</b>، البوت غير موجود في المكالمة {usermention}"

No_Next_Song_2_msg = "🚫 <b>انتهت الأغنية الحالية</b> ولا توجد أغنية تالية في القائمة لـ <i>{action}</i> من {usermention} 〰"




Song_Was_msg = "🎵 <b>تم {action} الأغنية</b> {emogi}\n<b>بواسطة:</b> {usermention}"

Song_Is_Requested_msg = "\n⊱ <i>طُلبت من:</i> {usermention}"

You_Are_Not_Auth_msg = "🚫 <b>ليس لديك صلاحية تنفيذ هذا الإجراء</b> 😉"

Song_Added_2_List = "📜 <b>تمت الإضافة إلى قائمة الانتظار</b> ❕\n\n"

UserBot_Left_msg = "📴 <b>انتهت الأغنية</b> وغادر البوت المكالمة لأنه لا توجد أغاني قادمة ❎"

Song_Was_ended = "✅ <b>انتهت الأغنية</b> وتم تشغيل التالية تلقائيًا 😎"

Bot_Join_msg = """حياتي هله ومية هله <b>{username}</b>
انا بوت اسمي {name}
⊱ شهادة فخر واعتزاز لانكم اضفتوني بكروبكم {grname}, ان اكون واحد منكم 🎈
⊱ حتى تعرف تستخدمني صح اكتب: "الصوتية" """

Sout_msg = """هلا يرويحتي: {username}
شرح تشغيل بالصوتية

.
⊱ اوامر التشغيل:
رن + اسم الصوتية

⊱ اوامر الايقاف:
تقدر توقف الصوتية الحالية وانهاء جميع الصوتيات في قائمة الانتظار عن طريق
1-  زر ⏹️
2-  /leave

⊱ اوامر التخطي:
تقدر تتخطى الصوتية الحالية وتشغيل الصوتية 
التالية في قائمة الانتظار عن طريق
1- زر ⏮️
2 - /skip

⊱ اوامر تكرار الصوتية الحالية
تقدر تعيد تشغيل الصوتية الحالية عن طريق
1 - زر 🔁
2- /repeat

⊱ اوامر كتم الصوتية الحالية
تقدر تكتم الصوتية الحالية عن طريق
1 - زر 🔇
2- /mute

⊱ اوامر الغاء كتم الصوتية الحالية
تقدر تفتح الكتم عن الصوتية الحالية عن طريق
1 - زر 🔉
2- /unmute

⊱ اوامر ايقاف الصوتية الحالية مؤقتا
تقدر توقف الصوتية الحالية عن طريق
1 - زر ⏸️
2- /pause

⊱ اوامر استئناف الصوتية الحالية
تقدر تكمل الصوتية الحالية عن طريق
1 - زر ▶️
2- /resume
.
"""

Call_Open_msg = "⊱ تم بدء الصوتية تعالوا خلي نسمع اصواتكم ✨"

Call_Close_msg = "⊱ تم انهاء الصوتية, نشوفكم مرة اخرة لاحقا 💍\n مدة الصوتية: {time}"

Help_User_Invite_msg = "جار دعوه الحساب المساعد انتظر 💞"

No_Help_User_Invite_msg = "حدثت مشكلة اثناء دعوه الحساب المساعد 💔"
import random
syrian_responses = {
    "اسكت": "حاضر عزيزي",
    "اخرس": "عيب لا تغلط",
    "بوت": random.choice([
        "نعٍـم حبيبـي المطـورٍ 🌝❤",
        "لاتقول بوت اسمي التاريخ 😒🔪",
        "يآبَعٍدِ رووحٍ التاريخ ❤️",
        "مشغول لاحد يكلمني 🤧🙁💔",
        "التاريخ يتحدث😌",
        "اضرب تحيه للتاريخ😌",
        "احترم التاريخ ❤️"
    ])
}

